php/framework-4.4.0/app/Controllers/board.php

    public function list(): string
    {
        $boardModel = new BoardModel();
        $page = $this->request->getVar('page') ?? 1;
        $perPage = 10;
        $startLimit = ($page-1)*$perPage;

        $list = $boardModel -> select('*') -> where('1=1') -> orderBy('bid', 'desc')->limit($perPage, $startLimit)->findAll($perPage, $startLimit);
---
SELECT COUNT(*) AS `numrows`
FROM `board`
SELECT *
FROM `board`
WHERE 1 = 1
ORDER BY `bid` DESC
 LIMIT 3