framework-4.4.0/app/Controllers/board.php

    public function view($bid = null)
    {
        // $db = db_connect();
        // $sql = "SELECT * from board where bid={$bid}";
        // $result = $db -> query($sql);
        // $data['view'] = $result->getRow();
        $boardModel = new BoardModel();
        $data['view'] = $boardModel -> where('bid', $bid)->first();
---
SELECT *
FROM `board`
WHERE `bid` = '16'
 LIMIT 1

            }
            return $this->response ->redirect(site_url('/boardview/'.$bid)); //쿼리성공후 board 페이지로 이동
        }else{ //신규 글 등록
            $boardModel ->insert($data);
---
INSERT INTO `board` (`userid`, `subject`, `content`, `regdate`) VALUES ('test', 'ajax 테스트', '에이젝스', '2023-09-14 10:39:54')