framework-4.4.0/app/Controllers/board.php

            $boardModel ->update($bid, $data);
            return $this->response ->redirect(site_url('/boardview/'.$bid)); //쿼리성공후 board 페이지로 이동
        }else{          // 신규 글 등록
            $boardModel ->insert($data);
---
INSERT INTO `board` (`userid`, `subject`, `content`, `regdate`) VALUES ('test', '파일 테스트22', 'test22', '2023-09-12 10:51:07')